Revit 2024 API
ExtrusionAnalyzerFaceAlignment Enumeration
 Indicates whether a face of the solid analyzed by ExtrusionAnalyzer is fully aligned, partially aligned, or unaligned with faces of the extrusion.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum ExtrusionAnalyzerFaceAlignment
Visual Basic
Public Enumeration ExtrusionAnalyzerFaceAlignment
Visual C++
public enum class ExtrusionAnalyzerFaceAlignment
Members
Member name | Description
FullyAligned |  The face is fully aligned with faces of the extrusion.
PartiallyAligned |  The face is only partially aligned with faces of the extrusion.
Unaligned |  The face is not aligned with any faces of the extrusion.
See Also
Autodesk.Revit.DB Namespace